In [1]:
import pandas as pd
import numpy as np

In [3]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine(
    "mysql+pymysql://root:Database%401234@localhost:3306/superstore_db"
)

df = pd.read_sql("SELECT * FROM sales", engine)
df.head()

,ï»¿Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,State,Region,Product ID,Category,Sub-Category,Sales,TotalAmount
0,1,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,South,FUR-BO-10001798,Furniture,Bookcases,261.96,261.96
1,2,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,South,FUR-CH-10000454,Furniture,Chairs,731.94,731.94
2,3,CA-2017-138688,2017-06-12,2017-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,California,West,OFF-LA-10000240,Office Supplies,Labels,14.62,14.62
3,4,US-2016-108966,2016-10-11,2016-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,Florida,South,FUR-TA-10000577,Furniture,Tables,957.58,957.58
4,5,US-2016-108966,2016-10-11,2016-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,Florida,South,OFF-ST-10000760,Office Supplies,Storage,22.37,22.37

In [5]:
df['Order Date'] = pd.to_datetime(df['Order Date'])

# Remove returns / negative sales
df = df[df['Sales'] > 0]

df.isnull().sum()

ï»¿Row ID        0
Order ID         0
Order Date       0
Ship Date        0
Ship Mode        0
Customer ID      0
Customer Name    0
Segment          0
Country          0
City             0
State            0
Region           0
Product ID       0
Category         0
Sub-Category     0
Sales            0
TotalAmount      0
dtype: int64

In [9]:
today = df['Order Date'].max()

In [11]:
rfm = df.groupby('Customer Name').agg({
    'Order Date': lambda x: (today - x.max()).days,
    'Order ID': 'count',
    'Sales': 'sum'
}).reset_index()

rfm.columns = ['Customer Name', 'Recency', 'Frequency', 'Monetary']
rfm.head()

     Customer Name  Recency  Frequency  Monetary
0    Aaron Bergman      415          6    886.15
1    Aaron Hawkins       12         11   1744.70
2   Aaron Smayling       88         10   3050.69
3  Adam Bellavance       54         18   7755.63
4        Adam Hart       34         20   3250.35

In [13]:
rfm['R_Score'] = pd.qcut(rfm['Recency'], 5, labels=[5,4,3,2,1])
rfm['F_Score'] = pd.qcut(rfm['Frequency'].rank(method='first'), 5, labels=[1,2,3,4,5])
rfm['M_Score'] = pd.qcut(rfm['Monetary'], 5, labels=[1,2,3,4,5])

In [15]:
rfm['RFM_Score'] = (
    rfm['R_Score'].astype(str) +
    rfm['F_Score'].astype(str) +
    rfm['M_Score'].astype(str)
)

rfm.head()

,Customer Name,Recency,Frequency,Monetary,R_Score,F_Score,M_Score,RFM_Score
0,Aaron Bergman,415,6,886.15,1,1,1,111
1,Aaron Hawkins,12,11,1744.70,5,3,3,533
2,Aaron Smayling,88,10,3050.69,3,2,4,324
3,Adam Bellavance,54,18,7755.63,3,5,5,355
4,Adam Hart,34,20,3250.35,4,5,4,454

In [17]:
def segment_customer(row):
    if row['RFM_Score'] >= '444':
        return 'Champions'
    elif row['RFM_Score'] >= '344':
        return 'Loyal Customers'
    elif row['RFM_Score'] >= '244':
        return 'Potential Loyalists'
    elif row['RFM_Score'] >= '144':
        return 'At Risk'
    else:
        return 'Hibernating'

rfm['Segment'] = rfm.apply(segment_customer, axis=1)
rfm.head()

,Customer Name,Recency,Frequency,Monetary,R_Score,F_Score,M_Score,RFM_Score,Segment
0,Aaron Bergman,415,6,886.15,1,1,1,111,Hibernating
1,Aaron Hawkins,12,11,1744.70,5,3,3,533,Champions
2,Aaron Smayling,88,10,3050.69,3,2,4,324,Potential Loyalists
3,Adam Bellavance,54,18,7755.63,3,5,5,355,Loyal Customers
4,Adam Hart,34,20,3250.35,4,5,4,454,Champions

In [19]:
rfm.groupby('Segment')['Monetary'].mean().sort_values(ascending=False)

Segment
Champions              3566.838955
Loyal Customers        3278.501667
Potential Loyalists    2909.608146
At Risk                2477.643162
Hibernating            1534.903309
Name: Monetary, dtype: float64

In [19]:
rfm.to_csv("week2_rfm_output.csv", index=False)

## Week 2
I implemented an RFM segmentation model using Python.
I calculated Recency, Frequency, and Monetary metrics, assigned quintile-based scores, and segmented customers into business-ready categories like Champions and At-Risk.